from scipy import stats

ages = [34,37,13,64,37,47,24,38, 26, 41,19, 51,44]

t_stat, p_value = stats.ttest_1samp(ages, popmean=30)

#-------------------------------------------------------- p_value - імовірність t_stat
# Що означає t_stat
# t_stat > 0 → середнє вибірки більше за 30.
# t_stat < 0 → середнє вибірки менше за 30.
# Чим далі від 0, тим сильніше відхилення від гіпотези.

print(f"T-test: {t_stat} , P-value: {p_value}")


# test mana uitni - первіряє, чи відрізняються розподіли двух незалежних вибірок
# використовують, коли дані не відповідають нормальному розподілу



